++++++++                   ; 8足す
[                          ; ブロック開始
    %
    >++++                  ; ループカウンタを4にする
    [                      ; 0でない間ループ
        >++                ; 2足す
        >+++               ; 3足す
        >+++               ; 3足す
        >+                 ; 1足す
        <<<<               ; カウンタの位置に戻る
        -                  ; カウンタをデクリメント
    ]                      ; カウンタが0でないならもう一度ループ
    >+　　　　　　　　　　　　　; 1足す
    >+                     ; 1足す
    >-                     ; 1引く
    >                      ; スキップ
    >+                     ; 1足す 
    [
        <
    ]
        <-
]
>>.>---.+++++++..+++.>>.<-.<.+++.------.--------.>>+.>++.